# Rebar Bend Data Hook Bend Radius Property

Source: https://www.revitapidocs.com/2026/2c5d5061-0db2-a2f1-44b5-6bfed651e4f4.htm

---

| Rebar Bend Data Hook Bend Radius Property |
| --- |

The radius of the hook fillets in the Rebar shape.
 The default value is 0\.0\.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HookBendRadius { get; set; }
```

```
Public Property HookBendRadius As Double
	Get
	Set
```

```
public:
property double HookBendRadius {
	double get ();
	void set (double value);
}
```

```
member HookBendRadius : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for hookBendRadius is not finite |

Remarks Inner radius, not centerline See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace